dudasdavid/RevvyDemoKit/STM32F411/Src/main.c
/* USER CODE BEGIN Header */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used 
  * @retval None
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include <math.h>
#include "WS2812_Lib.h"
#include "stm32f411e_discovery.h"
#include "stm32f411e_discovery_accelerometer.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

CRC_HandleTypeDef hcrc;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

SPI_HandleTypeDef hspi5;
DMA_HandleTypeDef hdma_spi5_tx;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim4;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim9;
TIM_HandleTypeDef htim10;
DMA_HandleTypeDef hdma_tim4_ch2;

UART_HandleTypeDef huart6;

osThreadId defaultTaskHandle;
osThreadId sensorTaskHandle;
osThreadId controlTaskHandle;
osThreadId commTaskHandle;
osThreadId idleTaskHandle;
osThreadId ledTaskHandle;
/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/
#define ABS(x)         (x < 0) ? (-x) : x
#define PI     3.14159

#define COMPASS_X_MAX 702
#define COMPASS_X_MIN -358
#define COMPASS_Y_MAX 293
#define COMPASS_Y_MIN -829
#define COMPASS_Z_MAX 845
#define COMPASS_Z_MIN -282

static volatile uint32_t ADC_Buf[6];
static volatile uint32_t ADC_Values[6];

static uint16_t mot1Cntr, mot1CntrPrev = 0; //L1
static uint16_t mot2Cntr, mot2CntrPrev = 0; //L2
static uint16_t mot3Cntr, mot3CntrPrev = 0; //L3
static uint16_t mot4Cntr, mot4CntrPrev = 0; //R1
static uint16_t mot5Cntr, mot5CntrPrev = 0; //R2
static uint16_t mot6Cntr, mot6CntrPrev = 0; //R3
static volatile uint8_t mot1Dir = 0; //L1
static volatile uint8_t mot2Dir = 0; //L2
static volatile uint8_t mot3Dir = 0; //L3
static volatile uint8_t mot4Dir = 0; //R1
static volatile uint8_t mot5Dir = 0; //R2
static volatile uint8_t mot6Dir = 0; //R3

static volatile uint32_t sen1Cntr, sen1Start, sen1End, sen1Length = 0; //Sensors
static volatile uint32_t sen2Cntr, sen2Start, sen2End, sen2Length = 0; //Sensors
static volatile uint32_t sen3Cntr, sen3Start, sen3End, sen3Length = 0; //Sensors
static volatile uint32_t sen4Cntr, sen4Start, sen4End, sen4Length = 0; //Sensors
static volatile float sen1Distance = 0;
static volatile float sen2Distance = 0;
static volatile float sen3Distance = 0;
static volatile float sen4Distance = 0;

static volatile float batteryVoltage1 = 0;
static volatile float batteryVoltage2 = 0;

static volatile uint16_t sen1AnalogValue = 0;
static volatile uint16_t sen2AnalogValue = 0;
static volatile uint16_t sen3AnalogValue = 0;
static volatile uint16_t sen4AnalogValue = 0;

static volatile uint32_t internalCounter = 0;

static volatile float roll,pitch,heading = 0;
static volatile float fNormAcc,fSinRoll,fCosRoll,fSinPitch,fCosPitch = 0.0f;
static volatile float accX,accY,accZ = 0;
static volatile float accXFiltered,accYFiltered,accZFiltered = 0;
static volatile float compassX,compassY,compassZ = 0;

static volatile float wheelL1Odometer_m, wheelL1Odometer_m_prev = 0;
static volatile float wheelL2Odometer_m, wheelL2Odometer_m_prev = 0;
static volatile float wheelL3Odometer_m, wheelL3Odometer_m_prev = 0;
static volatile float wheelR1Odometer_m, wheelR1Odometer_m_prev = 0;
static volatile float wheelR2Odometer_m, wheelR2Odometer_m_prev = 0;
static volatile float wheelR3Odometer_m, wheelR3Odometer_m_prev = 0;
static volatile float wheelL1Angle_deg = 0;
static volatile float wheelL2Angle_deg = 0;
static volatile float wheelL3Angle_deg = 0;
static volatile float wheelR1Angle_deg = 0;
static volatile float wheelR2Angle_deg = 0;
static volatile float wheelR3Angle_deg = 0;

static volatile float wheelL1RawVelocity_mps, wheelL1FiltVelocity_mps = 0;
static volatile float wheelL2RawVelocity_mps, wheelL2FiltVelocity_mps = 0;
static volatile float wheelL3RawVelocity_mps, wheelL3FiltVelocity_mps = 0;
static volatile float wheelR1RawVelocity_mps, wheelR1FiltVelocity_mps = 0;
static volatile float wheelR2RawVelocity_mps, wheelR2FiltVelocity_mps = 0;
static volatile float wheelR3RawVelocity_mps, wheelR3FiltVelocity_mps = 0;

static volatile float wheelSize_m = 0.20; // 20cm circumference
static volatile uint16_t encoderSignalsPerRound = 360; // 3 counts per motor round and a 120:1 gearbox
static volatile uint16_t speedSensingTaskCycle_ms = 10; // 10ms task cycle time

static volatile float referenceSpeedLeft = 0;
static volatile float referenceSpeedRight = 0;

static volatile uint32_t timeStamp =0;
static volatile uint32_t timeOutGuard =0;
static uint8_t receiveBuffer[3]={0};
static volatile float referenceSpeed = 0;
static volatile float referenceAngle = 0;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_I2C1_Init(void);
static void MX_ADC1_Init(void);
static void MX_CRC_Init(void);
static void MX_USART6_UART_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM5_Init(void);
static void MX_I2C3_Init(void);
static void MX_TIM9_Init(void);
static void MX_TIM10_Init(void);
static void MX_SPI5_Init(void);
void StartDefaultTask(void const * argument);
void StartSensorTask(void const * argument);
void StartControlTask(void const * argument);
void StartCommTask(void const * argument);
void StartIdleTask(void const * argument);
void StartLedTask(void const * argument);

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef* hadc){
  
